laurigates/mcu-tinkering-lab/packages/esp32-projects/it-troubleshooter/sdkconfig.defaults
# IT Troubleshooter - ESP32-S3 Configuration
# Target: Waveshare ESP32-S3-Zero

CONFIG_IDF_TARGET="esp32s3"

# --- USB (TinyUSB composite: HID keyboard + CDC serial) ---
CONFIG_TINYUSB_ENABLED=y
CONFIG_TINYUSB_HID_ENABLED=y
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=n
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000

# --- Flash & PSRAM (Waveshare ESP32-S3-Zero: 4MB flash, 2MB PSRAM) ---
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# --- PSRAM (2MB on ESP32-S3-Zero) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- Watchdog ---
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# --- mDNS hostname discovery (it-troubleshooter.local) ---
CONFIG_MDNS_ENABLED=y

# --- WiFi ---
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# --- Power Management --- disabled for lowest latency
CONFIG_PM_ENABLE=n

# --- TLS (required for HTTPS to Claude API) ---
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_ESP_TLS_INSECURE=n

# --- HTTP client ---
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
